backend/tests/p1-load-reset.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load during reset window"
    - duration: 30
      arrivalRate: 50
      name: "Spike during quarterly reset"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    expect: {}

scenarios:
  # Scenario 1: Bid placement during active pre-ping window
  - name: "Bid during pre-ping window"
    flow:
      - get:
          url: "/api/v1/auctions/active"
          capture:
            - json: "$[0].id"
              as: "auctionId"
          expect:
            - statusCode: 200
      - post:
          url: "/api/v1/auctions/{{ auctionId }}/bid"
          json:
            bidAmount: 100
            bidderAddress: "0x{{ $randomString(40) }}"
          expect:
            - statusCode: [200, 400]  # 400 expected during pre-ping for non-holders

  # Scenario 2: Concurrent bid placement under load
  - name: "Concurrent bids (holder vs non-holder)"
    flow:
      - get:
          url: "/api/v1/auctions/active"
          capture:
            - json: "$[0].id"
              as: "auctionId"
          expect:
            - statusCode: 200
      - loop:
          - post:
              url: "/api/v1/auctions/{{ auctionId }}/bid"
              json:
                bidAmount: "{{ $randomNumber(50, 500) }}"
                bidderAddress: "0x{{ $randomString(40) }}"
              expect:
                - statusCode: [200, 400, 429]
        count: 3

  # Scenario 3: Quarterly reset endpoint (admin)
  - name: "Trigger lease check during load"
    weight: 5  # Less frequent
    flow:
      - post:
          url: "/api/v1/admin/lease-check"
          expect:
            - statusCode: [200, 403]